<template>
  <div class="wrapper">
    <div class="section first">
      <div class="toning">
        <div class="title">Используй эффективно</div>
        <div class="description-container">
          <div class="description">Просмотрите эту инструкцию, чтобы ваше обучение было максимально продуктивным</div>
        </div>
        <div class="link__container">
          <ul class="link__list">
            <li class="link__item"><a href="#second">Как правильно работать с карточками</a> </li>
            <li class="link__item"><a href="#third">Как проходить тесты</a> </li>
            <li class="link__item"><a href="#fourth">Родителям, репетиторам и учителям</a> </li>
          </ul>
        </div>
      </div>
    </div>
    <div class="section second">
      <div id="second" class="second__title">Вкладка "Учить"</div>
      <div class="second__subtitle">Начните ваше обучение со страницы "Учить". Карточки слов устроены таким образом, 
        чтобы образовать максимальное количество ассоциативных связей, между словом и его значением. 
        Для полноценного запоминания вам потребуется около одной минуты на изучение каждой карточки. 
      </div>
      <div class="second__container">
        <div class="second__textbox">
          <div class="second__text">
            1. Прочтите слово, его транскрипцию и перевод. Если у вас существуют проблема с чтением транскрипции,
            нажмите на "Произношение". Прослушайте произношение слова несколько раз, после каждого прослушивания, постарайтесь воспроизвести
            произношение максимально точно. Проговаривайте вслух, это очень важно.
          </div>
          <div class="second__text">
            2. Обратите внимание на цвет слова и выделение. Цвет текста характеризует категорию, к которой слово относится. 
            в шапке карточки вы видите название категории, все слова которой, будут выделены этим цветом. Эти цевтовые подсказки 
            будут доступны вам в первых раундах тестирования на запоминание. Выделение же текста, характеризует частиречную принадлежность
            слова. В шапке вы также можете наблюдать, как будут выделены слова, принадлежащие к той или иной части речи. Подсказки выделения
            будут доступны вам в первом раунде тестирования. Большинство выделений частиречной принадлежности знакому вам со школы.
          </div>
          <div class="second__text">
            3. Обратите внимания на изображение. На картинке будет продимонстрировано значение запоминаемого слова. Повторите произношение на английском
            два-три раза рассматривая картинку, будет здорово если вы отметите какие нибудь особенности изображения. На изображении для примера, меня, к примеру, 
            смутила неправильная анатомия стопы.
          </div>
          <div class="second__text">
            4. И наконец самый эффективный прием запоминания иностранных слов - мнемотекст. Мнемотекст, это описание, связывающее произношение слова на английском,
            с чем то созвучным из привычного вам языка и переводом слова. Для эффективной работы приема, нужно как можно глубже прочувствовать ассоциацию, 
            представить ее в своем воображении, наделить ее яркими деталями. В идеале даже связать ее со всеми органами чувств. Однажды, я демонстрировал эффективность этого приема моему другу.
            Для демонстрации я выбрал слово 'adventure' (эдвенчур - если грубо), я сказа следующее: С чем бы могло быть созвучно это слово? Одуванчик! Смотри Adventure переводится как приключение,
            а созвучно в русском с одуванчиком. Нам нужно связать ассоциацию произношения со значением. Представь себе огромную-огромную поляну, где то посреди леса. В какую сторону не посмотри,
            все-все пространство, до самого леса, усеяно плотным ковром ярко-желтых одуванчиков. И посреди этой поляны стоишь ты. Как тебе больше нравится?
            Ты видишь все из глаз или смотришь на себя со стороны? В одной руке ты держишь палку, которая лежит у тебя на плече, а на конце этой палки узелок, с какими то вещами или едой. Теперь представь всю описанную картину целиком.
            Ты чувствуешь запах? Чувстввуешь, как греет солнышко? Как легкий ветер обдувает тебя и колышит море одуванчиков? После мы поговорили на отвелеченные темы еще какое-то время. Спустя неделю,
            я спросил его перевод слова, и он легко его вспомнил, как вспомнил его через месяц, а потом и через три. Я уверен, что он и сейчас его помнит.
          </div>
          <div class="second__text">
            5. За один подход изучайте не менее 10 слов. Все изученные карточки перейдут в раздел тестов. И когда вы перейдете на страницу тестов, в первую очередь, для тестирования приложение вам покажет слова именно из пройденных карточек.
          </div>
        </div>
        <div class="second__imagebox">
          <img src="../../public/images/ticket.png" alt="" class="second__image">
          <div class="second__text second__text_lowwidth">P.S. Большиство людей уже знают те или иные слова. Как минимум, почти каждый знает как переводится "mother", "father", "cat", "dog" и многие другие.
            Встречая такие слова, перед тем как нажать на кнопку "Запомнил >>", поставьте галочку "Я знаю это слово", тогда карточка уйдет сразу же на споледний раунд тестирования и вам не надо будет каждый раз отвечать на и без того известное слово.
          </div>
        </div>
      </div>      
    </div>
    <div class="section third">
      <div id="third" class="second__title">Тесты</div>
      <div class="second__subtitle">
         Некоторым для запоминания проще несколько раз прогнать слово в тестах, чем учить слова по карточкам. ОДнако, лучше использовать и то и другое.
      </div>
      <div class="second__container">
        <div class="second__imagebox">
          <img src="../../public/images/test-item.png" alt="" class="second__image second__image_nonemargin">
        </div>
        <div class="second__textbox">
          <div class="second__text">
            Процесс запоминания на тестах построен на 4 раундах. С каждым новым рандом с карточек будет исчезать одна из подсказок.
            В случае правильного ответа, карточка записывается на следующий раунд. Слово считается выученным, если вы ответили на 
            карточку правильно во всех раундах. Возможность переходить на раунды выше первого, открывается, когда на этом уровне 
            скапливается не менее 10 карточек. В первом раунде вам также доступна кнопка "Я знаю это слово". 
          </div>
          <div class="second__text">
            В первом раунде, вам доступны:, картинка, подсказки выделения и цветовые подсказки. Нажмите на "подсказки выделения" или "цветовые подсказки",
            чтобы появилось напоминание, какой цвет или какое выделение на что указывают. Во втором раунде, пропадает выделение, на третьем цвета, 
            на четвертом из теста исчезнет и картинка. 
          </div>
          <div class="second__text">
            В случае неправильного ответа, появится кнопка "Показать правильный ответ". нажав на нее, вы сможете повторно просмотреть карточку слова. 
            Возможность посмотреть карточку в случае неправильного ответа, появляется во всех раундах и даже на "экзамене".
          </div>
          <div class="second__text">
            Также в тестах доступна еще одна функция - "Экзамен". При первом прохождении экзамена, помимо подсчета вашей результативности, все слова на которые вы ответите правильно, 
            будут считаться выученными и больше не попадутся вам в тестах. На "Экзамене" все подсказки недоступны.
          </div>
        </div>
      </div>      
    </div>
    <div class="section fourth">
      <div id="fourth" class="second__title">Родителям, учителям и репетиторам</div>
      <div class="second__subtitle">Смотрите за прогрессом своих подопечных, выдавайте задания, отслеживайте выполнение.</div>
      <div class="item__container">
        <div class="item__text">1. Пройдите по ссылке своего профиля. Доступ к профилю доступен только после регистрации.</div>
        <img src="../../public/images/nav.png" alt="" class="item__img">
      </div>
      <div class="item__container">
        <div class="item__text">2. Прокрутите страницу профиля до раздела подопечные аккаунты. В строку поиска введите id аккаунта вашего подопечного и нажмите кнопку "Запросить подтверждение".
          Вы сможете просматривать информацию подопечного аккаунта, как только владелец аккаунта подтвердит ваше наставничество. А в навигационном меню появится раздел "Учительская".
        </div>
        <img src="../../public/images/childs.png" alt="" class="item__img">
      </div>
      <div class="item__container">
        <div class="item__text">3. На странице "Учительской", во вкладке "Информация об учениках" вы можете отслеживать прогресс ваших учеников, посмотреть время и длительность последнего посещение, а также следить за ходом выполнения, выданного вами задания.
          В этом списке ученик появится только после того, как подтвердит ваше наставничество. Кликните по имени в списке, чтобы просмотреть информацию.
        </div>
        <img src="../../public/images/childs-info.png" alt="" class="item__img">
      </div>
      <div class="item__container">
        <div class="item__text">4. Во вкладке "Создать задание" в строке поиска введите слово или часть слова, которое хотите добавить в задание. В списке ниже появятся слова содержащие поисковый запрос. 
          При помощи клика добавьте нужное слово в список длч выдачи задания. Настояьтельно рекомендуем давать в задании не менее 10 слов. Лучше всего около 20.
        </div>
        <img src="../../public/images/find-words.png" alt="" class="item__img">
      </div>
      <div class="item__container">
        <div class="item__text">5. Из списка подтвежденных учеников выберите тех, кому хотите выдать сформированное задание и нажмите на кнопку "Отправить". После отправки вы сможете отслеживать прогресс выполнения во вкладке "Информация об учениках"
        </div>
        <img src="../../public/images/send-quest.png" alt="" class="item__img">
      </div>
      <div class="item__container">
        <div class="item__text">6. Чтобы получить возможность добавлять новые слова, необходимо получить права модератора. На данный момент, такие права могу выдать только я. Для этого можете написать мне в социальных сетях, ссылки на профиль есть в конце страницы.
        </div>
      </div>
    </div>
  </div>
  <my-footer/>
</template>
<script>
import MyFooter from '@/components/MyFooter.vue';

export default {
  components: {MyFooter},
    methods: {
      routerWithParam(param) {
        this.$store.commit('user/setActiveStep', param)
        switch(param) {
          case 0:
            this.$router.push('/learn-page')
            break;
          case 1: 
            this.$router.push('/test-page')
            break;
        }
      },
    }
}
</script>
<style scoped>
  .wrapper {
    width: 100%;
    margin: 0 auto;
    min-height: calc(100vh - 140px);
  }
  .section {
    width: 100%;
    max-width: 1440px;
  }
  .toning {
    width: 100%;
    height: 700px;
    background-color: rgba(0, 0, 0, 0.13);
  }
  .first {
    background-image: url('../../public/images/use-first.jpg');
    min-height: 700px;
    background-size: cover;
    background-repeat: no-repeat;
  }
  .title {
    font-size: 52px;
    text-align: center;
    font-weight: bold;
    padding-top: 30px;
  }
  .description-container {
    width: 100%;
    display: flex;
    justify-content: center;
    padding: 30px 20px;
  }
  .description {
    font-size: 26px;
    text-align: center;
    max-width: 600px;
  }

.link-item {
  font-size: 26px;
  font-weight: bold;
  cursor: pointer;
}
.link-item:hover {
  text-decoration: underline;
}
.start {
  position: absolute;
  top: 370px;
  left: 200px;
}
.teacher {
  position: absolute;
  right: 160px;
  top: 370px;
}
.admin {
  position: absolute;
  top: 600px;
  left: 250px;
}
.test {
  position: absolute;
  top: 600px;
  right: 270px;
}
.second {
    background-image: linear-gradient(225deg, lightblue, white);
  }
.second__title {
  padding-top: 30px;
  font-size: 32px;
  font-weight: bold;
  text-align: center;
}
.second__subtitle {
  text-align: center;
  font-size: 20px;
  margin: 30px auto 0;
  max-width: 1024px;
}
.second__container {
  width: 100%;
  display: flex;
  justify-content: space-around;
  padding: 30px 10px;
}
.second__textbox {
  width: 55%;
}
.second__text {
  margin-top: 20px;
}
.second__image {
  width: 450px;
  height: 450px;
  margin-top: 50px;
}
.second__image_nonemargin {
  margin-top: 0;
}
.second__text_lowwidth {
  max-width: 450px;
}
.third {
  background-image: linear-gradient(225deg, white, lightblue)
}
.item__container {
  display: flex;
  flex-direction: column;
  margin-top: 15px;
}
.item__text {
  margin: 15px auto;
  text-align: center;
  max-width: 1024px;
  font-size: 18px;
}
.item__img {
  max-width: 1024px;
  margin: 20px auto;
}
.link__container {
  display: flex;
}
.link__list {
  margin: 0 auto;
}
.link__item {
  font-size: 20px;
  margin-top: 15px;
}
</style>